<template>
  <div class="date">2023/4/1</div>
  <main>
    <h1>ブログをつくりました</h1>
    <h2>
      <p>
        ブログを作ってみました。ブログはいままでにやったことがなかったのでこれが初ですね。<br />ブログのために自サイトを作ったわけではないのでいまのところはおまけ程度に考えています。
      </p>
      <p>
        いまのところこのサイトはVue+TypeScriptで作ったものをCloudflare
        Pagesでホスティングしています。大したこと書いてないのに無駄にSPAです。404対策が面倒でした<br />たぶんブログを書くならAstroとかHugoとかNuxt.jsみたいなSSGを使うべきなんでしょうけれど、ついでなのでVue.jsのみで書いています。<br />なんのついでかというと、MisskeyのフォークをしたくてTypeScriptとVue.jsの勉強をしていて（Misskeyがそれらで書かれているため）そのついでとして自サイトをつくろうということになりました。htmlやらscssやらの知識も要りそうなので丁度いいですね。<br />そして、トップページだとあまりにも寂しいのでブログも書くことにしました。<br />ただ、ちょっとブログを書くのに使うにはいろいろとめんどくさい気がするのでもしかしたら近い将来には/posts/のみいまのサイトから切り離すか丸ごと全部SSGで作り直すかもしれません。
      </p>
      <p>
        せっかく商用利用可のCloudflare
        Pagesでホスティングしているので本格的に書くようになったらアドセンスも導入するかもしれませんが、いまはあまり考えていません。<br />faviconなどをどうするか悩み中です。
      </p>
    </h2>
  </main>
</template>

<style scoped lang="scss">
@import '../../assets/posts.scss';
</style>
